{"actions": {"count": 3, "url": "https://api.congress.gov/v3/bill/117/hr/7224/actions?format=json"}, "committees": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7224/committees?format=json"}, "congress": 117, "constitutionalAuthorityStatementText": "<pre>\n[Congressional Record Volume 168, Number 53 (Thursday, March 24, 2022)]\n[House]\nFrom the Congressional Record Online through the Government Publishing Office [<a href=\"https://www.gpo.gov\">www.gpo.gov</a>]\nBy Mr. STEUBE:\nH.R. 7224.\nCongress has the power to enact this legislation pursuant\nto the following:\nTo regulate Commerce with foreign Nations, and among the\nseveral States, and with the Indian Tribes;\nTo establish an uniform Rule of Naturalization, and uniform\nLaws on the subject of Bankruptcies throughout the United\nStates;\nTo coin Money, regulate the Value thereof, and of foreign\nCoin, and fix the Standard of Weights and Measures;\nTo provide for the Punishment of counterfeiting the\nSecurities and current Coin of the United States;\nTo establish Post Offices and Post Roads;\nTo promote the Progress of Science and useful Arts, by\nsecuring for limited Times to Authors and Inventors the\nexclusive Right to their respective Writings and Discoveries;\nTo constitute Tribunals inferior to the supreme Court;\nTo define and punish Piracies and Felonies committed on the\nhigh Seas, and Offenses against the Law of Nations;\nTo declare War, grant Letters of Marque and Reprisal, and\nmake Rules concerning Captures on Land and Water;\nTo raise and support Armies, but no Appropriation of Money\nto that Use shall be for a longer Term than two Years;\nTo provide and maintain a Navy;\nTo make Rules for the Government and Regulation of the land\nand naval Forces;\nTo provide for calling forth the Militia to execute the\nLaws of the Union, suppress Insurrections and repel\nInvasions;\nTo provide for organizing, arming, and disciplining, the\nMilitia, and for governing such Part of them as may be\nemployed in the Service of the United States, reserving to\nthe States respectively, the Appointment of the Officers, and\nthe Authority of training the Militia according to the\ndiscipline prescribed by Congress;\nTo exercise exclusive Legislation in all Cases whatsoever,\nover such District (not exceeding ten Miles square) as may,\nby Cession of particular States, and the acceptance of\nCongress, become the Seat of the Government of the United\nStates, and to exercise like Authority over all Places\npurchased by the Consent of the Legislature of the State in\nwhich the Same shall be, for the Erection of Forts,\nMagazines, Arsenals, dock-Yards, and other needful Buildings;\nAnd\nTo make all Laws which shall be necessary and proper for\ncarrying into Execution the foregoing Powers, and all other\nPowers vested by this Constitution in the Government of the\nUnited States, or in any Department or Officer thereof.\n[Page H3865]\n</pre>", "cosponsors": {"count": 5, "countIncludingWithdrawnCosponsors": 5, "url": "https://api.congress.gov/v3/bill/117/hr/7224/cosponsors?format=json"}, "introducedDate": "2022-03-24", "latestAction": {"actionDate": "2022-03-24", "text": "Referred to the House Committee on Foreign Affairs."}, "number": "7224", "originChamber": "House", "originChamberCode": "H", "policyArea": {"name": "International Affairs"}, "sponsors": [{"bioguideId": "S001214", "district": 17, "firstName": "W.", "fullName": "Rep. Steube, W. Gregory [R-FL-17]", "isByRequest": "N", "lastName": "Steube", "middleName": "Gregory", "party": "R", "state": "FL", "url": "https://api.congress.gov/v3/member/S001214?format=json"}], "subjects": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7224/subjects?format=json"}, "summaries": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7224/summaries?format=json"}, "textVersions": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7224/text?format=json"}, "title": "United Nations Human Rights Council Reform Act", "titles": {"count": 3, "url": "https://api.congress.gov/v3/bill/117/hr/7224/titles?format=json"}, "type": "HR", "updateDate": "2024-02-07T11:38:03Z", "updateDateIncludingText": "2024-02-07T11:38:03Z"}