{"actions": {"count": 4, "url": "https://api.congress.gov/v3/bill/117/hr/7498/actions?format=json"}, "committees": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7498/committees?format=json"}, "congress": 117, "constitutionalAuthorityStatementText": "<pre>\n[Congressional Record Volume 168, Number 63 (Monday, April 11, 2022)]\n[House]\nFrom the Congressional Record Online through the Government Publishing Office [<a href=\"https://www.gpo.gov\">www.gpo.gov</a>]\nBy Mr. STEUBE:\nH.R. 7498.\nCongress has the power to enact this legislation pursuant\nto the following:\nTo regulate Commerce with foreign Nations, and among the\nseveral States, and with the Indian Tribes; To establish an\nuniform Rule of Naturalization, and uniform Laws on the\nsubject of Bankruptcies throughout the United States; To coin\nMoney, regulate the Value thereof, and of foreign Coin, and\nfix the Standard of Weights and Measures; To provide for the\nPunishment of counterfeiting the Securities and current Coin\nof the United States; To establish Post Offices and Post\nRoads; To promote the Progress of Science and useful Arts, by\nsecuring for limited Times to Authors and Inventors the\nexclusive Right to their respective Writings and Discoveries;\nTo constitute Tribunals inferior to the supreme Court; To\ndefine and punish Piracies and Felonies committed on the high\nSeas, and Offenses against the Law of Nations: To declare\nWar, grant Letters of Marque and Reprisal, and make Rules\nconcerning Captures on Land and Water; To raise and support\nArmies, but no Appropriation of Money to that Use shall be\nfor a longer Term than two Years; To provide and maintain a\nNavy; To make Rules for the Government and Regulation of the\nland and naval Forces; To provide for calling forth the\nMilitia to execute the Laws of the Union, suppress\nInsurrections and repel Invasions; To provide for organizing,\narming, and disciplining, the Militia, and for governing such\nPart of them as may be employed in the Service of the United\nStates, reserving to the States respectively, the Appointment\nof the Officers, and the Authority of training the Militia\naccording to the discipline prescribed by Congress; To\nexercise exclusive Legislation in all Cases whatsoever, over\nsuch District (not exceeding ten Miles square) as may, by\nCession of particular States, and the acceptance of Congress,\nbecome the Seat of the Government of the United States, and\nto exercise like Authority over all Places purchased by the\nConsent of the Legislature of the State in which the Same\nshall be, for the Erection of Forts, Magazines, Arsenals,\ndock-Yards, and other needful Buildings; And To make all laws\nwhich shall be necessary and proper for carrying into\nExecution the foregoing Powers, and all other Powers vested\nby this Constitution in the Government of the United States,\nor in any Department or Officer thereof.\n[Page H4439]\n</pre>", "cosponsors": {"count": 1, "countIncludingWithdrawnCosponsors": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7498/cosponsors?format=json"}, "introducedDate": "2022-04-11", "latestAction": {"actionDate": "2022-05-05", "text": "Referred to the Subcommittee on General Farm Commodities and Risk Management."}, "number": "7498", "originChamber": "House", "originChamberCode": "H", "policyArea": {"name": "Agriculture and Food"}, "sponsors": [{"bioguideId": "S001214", "district": 17, "firstName": "W.", "fullName": "Rep. Steube, W. Gregory [R-FL-17]", "isByRequest": "N", "lastName": "Steube", "middleName": "Gregory", "party": "R", "state": "FL", "url": "https://api.congress.gov/v3/member/S001214?format=json"}], "subjects": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7498/subjects?format=json"}, "summaries": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7498/summaries?format=json"}, "textVersions": {"count": 1, "url": "https://api.congress.gov/v3/bill/117/hr/7498/text?format=json"}, "title": "TEMP Act", "titles": {"count": 4, "url": "https://api.congress.gov/v3/bill/117/hr/7498/titles?format=json"}, "type": "HR", "updateDate": "2024-02-05T11:45:06Z", "updateDateIncludingText": "2024-02-05T11:45:06Z"}